FC_Employee_Module/absenceAPI_smoke.yml
execution:
#- executor: jmeter
- concurrency: 10
  ramp-up: 10s
  hold-for: 2m
  scenario: Employee_Sand_Server_Apis

scenarios:
  Employee_Sand_Server_Apis:
    script: Employee_Sand_Server_Apis.jmx

modules:
  console:
    disable: true # disable runtime console reporter

reporting:
#- module: console
- module: passfail
  criteria:
  - avg-rt>10s for 30s, stop as failed
  - fail>50% for 20s, stop as failed